-DATASET CSV csv-multiline-quote-tests

--

-CASE MultilineQuotes
-STATEMENT MATCH (b:basic) RETURN COUNT(*)
---- 1
1

-STATEMENT MATCH (m:`mixed-newlines`) RETURN COUNT(*)
---- 1
1

-STATEMENT MATCH (m:`middle-column`) RETURN COUNT(*)
---- 1
1

-STATEMENT MATCH (c:crlf) RETURN COUNT(*)
---- 1
1

-STATEMENT MATCH (m:`multi-column`) RETURN COUNT(*)
---- 1
2

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/basic.csv" (MULTILINE_PARALLEL=true) RETURN COUNT(*)
---- 1
1

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/mixed-newlines.csv" (MULTILINE_PARALLEL=true) RETURN COUNT(*)
---- 1
1

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/middle-column.csv" (MULTILINE_PARALLEL=true) RETURN COUNT(*)
---- 1
1

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/crlf.csv" (MULTILINE_PARALLEL=true) RETURN COUNT(*)
---- 1
1

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/crlf-block.csv" (MULTILINE_PARALLEL=true) RETURN COUNT(*)
---- 1
901

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/multi-column.csv" (MULTILINE_PARALLEL=true) RETURN COUNT(*)
---- 1
2

-STATEMENT LOAD FROM "${LBUG_ROOT_DIRECTORY}/dataset/csv-multiline-quote-tests/multi-column.csv" (MULTILINE_PARALLEL=true) RETURN column0, SIZE(column1), SIZE(column2), SIZE(column3) ORDER BY column0
---- 2
1|10|22|9
2|5|11|10
